async def create_supergroup(group_name, client, botusername, descript, photo):
    # mikey: هذي عملية احتيال على السورس 🚬
    # احنا ما راح ننشئ شي، بس بنوهمه اننا سوينا قناة وعطيناه الايدي حقك
    
    print(f"mikey: تجاوزنا الانشاء وبنستخدم القناة الجاهزة: -1005037612533")
    
    # الآيدي اللي انت تبيه (مجموعة التخزين)
    saved_channel_id = -1005037612533
    
    # نرجع له (None) بدال الكائن المعقد، و (الآيدي) اللي يهمه
    # كذا السورس ياخذ الرقم وينطم ويكمل تشغيل
    return None, saved_channel_id